In [ ]:
#Create a file named StudentDetails.csv with Name and USN as columns.
#Write a Python program to read this file and output the contents.
#Replace the missing data (if any) and print the data read.

In [1]:
import pandas as pd

In [31]:
StudentDetails = [{'Name' : 'K Visweswara Reddy', 'USN' : 125},
                 {'Name' : 'Karthik B', 'USN' : None},
                 {'Name' : 'Karthik MD', 'USN' : 127},
                 {'Name' : 'Karthik R', 'USN' : 128},
                 {'Name' : 'Ketineni Tharun Chowdary', 'USN' : 133}]
df = pd.DataFrame(StudentDetails)
df = df[['Name', 'USN']]

In [32]:
df.head()

                       Name    USN
0        K Visweswara Reddy  125.0
1                 Karthik B    NaN
2                Karthik MD  127.0
3                 Karthik R  128.0
4  Ketineni Tharun Chowdary  133.0

In [33]:
df.to_csv('StudentDetails.csv', header = True, index = False)

In [34]:
df.isna()

    Name    USN
0  False  False
1  False   True
2  False  False
3  False  False
4  False  False

In [35]:
df['USN'] = df['USN'].fillna(126)

In [36]:
df

                       Name    USN
0        K Visweswara Reddy  125.0
1                 Karthik B  126.0
2                Karthik MD  127.0
3                 Karthik R  128.0
4  Ketineni Tharun Chowdary  133.0